iakov/trik_msp430_firmware_usb/Trik_Devices/trik_protocolhandler.c
/*
 * Trik_ProtocolHandler.c
 *
 *  Created on: October 21, 2014
 *      Author: Rostislav Varzar
 */

#include <string.h>
#include <stdio.h>
#include <stdlib.h>
#include <ctype.h>
#include <msp430f5510.h>
#include <stdint.h>
#include "trik_hardpwm.h"
#include "trik_protocolhandler.h"
#include "trik_motor.h"
#include "trik_sensor.h"
#include "trik_encoder.h"
#include "trik_bsl.h"
#include "trik_devices.h"
#include "trik_async.h"
#include "trik_touch.h"
#include "trik_port.h"
#include "trik_softi2c.h"
#include "trik_softpwm.h"
#include "trik_sc16is7x0.h"
#include "trik_version.h"

uint8_t TO_HEX(uint8_t i)
{
    return (i <= 9 ? '0' + i : 'A' - 10 + i);
}

void char2hex(char *string, uint8_t number)
{
    string[0] = TO_HEX((number & 0x00F0) >> 4);
    string[1] = TO_HEX(number & 0x000F);
    string[2] = '\0';
}

uint32_t hex2num(char *string, uint16_t pos, uint16_t numsize)
{
    uint32_t resnum = 0;
    uint32_t tmpnum = 0;
    char c = 0;
    for (uint16_t i = 0; i < numsize; i++)
    {
        c = toupper(string[pos+i]);
        tmpnum = c > '9' ? c - 'A' + 10 : c - '0';
        resnum |= (tmpnum << ((numsize - i - 1) * 4));
    }
    return resnum;
}

/// Read register response
void PROTOCOL_recvResponse(char *r_str, uint8_t dev_addr, uint8_t resp_code, uint8_t reg_addr, uint32_t reg_val)
{
    char stmp1[MAX_STRING_LENGTH]; //Temp string
    uint8_t t11,t12,t13,t14; //Temp vars
    uint8_t crc; //Checksum

    t11 = (uint8_t)((reg_val & 0xFF000000) >> 24);
    t12 = (uint8_t)((reg_val & 0x00FF0000) >> 16);
    t13 = (uint8_t)((reg_val & 0x0000FF00) >> 8);
    t14 = (uint8_t)(reg_val & 0x000000FF);

    r_str[0] = ':';
    r_str[1] = '\0';

    char2hex(stmp1,dev_addr);
    strcat(r_str,stmp1);

    char2hex(stmp1,resp_code);
    strcat(r_str,stmp1);

    char2hex(stmp1,reg_addr);
    strcat(r_str,stmp1);

    char2hex(stmp1,t11);
    strcat(r_str,stmp1);
    char2hex(stmp1,t12);
    strcat(r_str,stmp1);
    char2hex(stmp1,t13);
    strcat(r_str,stmp1);
    char2hex(stmp1,t14);
    strcat(r_str,stmp1);

    crc = 0 - (dev_addr + resp_code + reg_addr + t11 + t12 + t13 + t14);
    char2hex(stmp1,crc);
    strcat(r_str,stmp1);

    strcat(r_str,"\n\0");
}

/// This function returns true if there's an 0x0D character in the string; and if
/// so, it trims the 0x0D and anything that had followed it.
uint8_t retInString (char* string)
{
    uint8_t retPos = 0,i,len;
    char tempStr[MAX_STRING_LENGTH] = "";

    strncpy(tempStr,string,strlen(string));  // Make a copy of the string
    len = strlen(tempStr);

    // Find 0x0D; if not found, retPos ends up at len
    while ((tempStr[retPos] != 0x0A) && (tempStr[retPos] != 0x0D) &&
           (retPos++ < len)) ;

    // If 0x0A was actually found...
    if ((retPos < len) && (tempStr[retPos] == 0x0A)){

        // Empty the buffer
        for (i = 0; i < MAX_STRING_LENGTH; i++){
            string[i] = 0x00;
        }

        //...trim the input string to just before 0x0D
        strncpy(string,tempStr,retPos);

        //...and tell the calling function that we did so
        return (True) ;

    } else if (tempStr[retPos] == 0x0A) {

        // Empty the buffer
        for (i = 0; i < MAX_STRING_LENGTH; i++){
            string[i] = 0x00;
        }

        //...trim the input string to just before 0x0D
        strncpy(string,tempStr,retPos);

        //...and tell the calling function that we did so
        return (True) ;
    } else if (retPos < len){
        // Empty the buffer
        for (i = 0; i < MAX_STRING_LENGTH; i++){
            string[i] = 0x00;
        }

        //...trim the input string to just before 0x0D
        strncpy(string,tempStr,retPos);

        //...and tell the calling function that we did so
        return (True) ;
    }

    return (False) ; // Otherwise, it wasn't found
}

/// Protocol handler
uint8_t PROTOCOL_handler(char *in_str, char *out_str)
{
	uint8_t devaddr1 = 0;   //Device address
	uint8_t func1 = 0;      //Function number
	uint8_t regaddr1 = 0;   //Register address
	uint32_t regval1 = 0;   //Register value
	uint8_t crc1 = 0;       //Cheksum
	uint8_t crc2 = 0;       //Calculated checksum

	// Find errirs in received packet

	// Start condition error
	if (in_str[0]!=':')
	{
        PROTOCOL_recvResponse(out_str,0x00,0x80,0x00,START_ERROR);
		return START_ERROR;
	}

	// Incorrect packet length
	if ((strlen(in_str)!=9) && (strlen(in_str)!=17))
	{
		PROTOCOL_recvResponse(out_str,0x00,0x80,0x00,LENGTH_ERROR);
		return LENGTH_ERROR;
	}

	// Get device address
	devaddr1 = hex2num(in_str, 1, NUM_BYTE);

	// Get function
	func1 = hex2num(in_str, 3, NUM_BYTE);

	// Get register address
	regaddr1 = hex2num(in_str, 5, NUM_BYTE);

	// Get register value
    regval1 = hex2num(in_str, 7, NUM_DWORD);

    // Device addresses range
	if ((devaddr1>MAX_DEVICES) && (devaddr1!=BSL))
	{
	    PROTOCOL_recvResponse(out_str,devaddr1,func1+0x80,regaddr1,DEV_ADDR_ERROR);
		return DEV_ADDR_ERROR;
	}

	// Motor registers addresses range
	// if (((devaddr1>=MOTOR1) && (devaddr1<=MOTOR4)) && (regaddr1>0x06))
	if (((devaddr1<=MOTOR4)) && (regaddr1>0x07))
	{
	    PROTOCOL_recvResponse(out_str,devaddr1,func1+0x80,regaddr1,REG_ADDR_ERROR);
		return REG_ADDR_ERROR;
	}

	// Sensor registers addresses range
	if (((devaddr1>=SENSOR1) && (devaddr1<=SENSOR18)) && (regaddr1>0x03))
	{
	    PROTOCOL_recvResponse(out_str,devaddr1,func1+0x80,regaddr1,REG_ADDR_ERROR);
		return REG_ADDR_ERROR;
	}

	// Encoder registers addresses range
	if (((devaddr1>=ENCODER1) && (devaddr1<=ENCODER4)) && (regaddr1>0x02))
	{
	    PROTOCOL_recvResponse(out_str,devaddr1,func1+0x80,regaddr1,REG_ADDR_ERROR);
	    return REG_ADDR_ERROR;
	}

    // Port registers addresses range
    if (((devaddr1>=PORT1) && (devaddr1<=PORTJ)) && (regaddr1>0x09))
    {
        PROTOCOL_recvResponse(out_str,devaddr1,func1+0x80,regaddr1,REG_ADDR_ERROR);
        return REG_ADDR_ERROR;
    }

