iakov/trik_msp430_firmware_usb/Trik_Devices/trik_protocolhandler.c
        // Ports
        if ((devaddr1>=PORT1) && (devaddr1<=PORTJ))
        {
            if (regaddr1==PVER)
                PROTOCOL_recvResponse(out_str,devaddr1,NO_ERROR,regaddr1,PORT_VERSION);
            else
                PROTOCOL_recvResponse(out_str,devaddr1,NO_ERROR,regaddr1,PORT_read(devaddr1,regaddr1));
            return NO_ERROR;
        }

        // Async timer
        if ((devaddr1==ASYNCTIMER))
        {
            if (regaddr1==AATCTL)
                PROTOCOL_recvResponse(out_str,devaddr1,NO_ERROR,regaddr1,ASYNCTMR.ATCTL);
            if (regaddr1==AATPER)
                PROTOCOL_recvResponse(out_str,devaddr1,NO_ERROR,regaddr1,ASYNCTMR.ATPER);
            if (regaddr1==AATVAL)
                PROTOCOL_recvResponse(out_str,devaddr1,NO_ERROR,regaddr1,ASYNCTMR.ATVAL);
            if (regaddr1==AATVER)
                PROTOCOL_recvResponse(out_str,devaddr1,NO_ERROR,regaddr1,ATIMER_VERSION);
            return NO_ERROR;
        }

        // Touch controller
        if ((devaddr1==TOUCHDEVICE))
        {
            if (regaddr1==TTMOD)
                PROTOCOL_recvResponse(out_str,devaddr1,NO_ERROR,regaddr1,TOUCH.TMOD);
            if (regaddr1==TMINX)
                PROTOCOL_recvResponse(out_str,devaddr1,NO_ERROR,regaddr1,TOUCH.MINX);
            if (regaddr1==TMAXX)
                PROTOCOL_recvResponse(out_str,devaddr1,NO_ERROR,regaddr1,TOUCH.MAXX);
            if (regaddr1==TMINY)
                PROTOCOL_recvResponse(out_str,devaddr1,NO_ERROR,regaddr1,TOUCH.MINY);
            if (regaddr1==TMAXY)
                PROTOCOL_recvResponse(out_str,devaddr1,NO_ERROR,regaddr1,TOUCH.MAXY);
            if (regaddr1==TSCRX)
                PROTOCOL_recvResponse(out_str,devaddr1,NO_ERROR,regaddr1,TOUCH.SCRX);
            if (regaddr1==TSCRY)
                PROTOCOL_recvResponse(out_str,devaddr1,NO_ERROR,regaddr1,TOUCH.SCRY);
            if (regaddr1==TCURX)
                PROTOCOL_recvResponse(out_str,devaddr1,NO_ERROR,regaddr1,TOUCH.CURX);
            if (regaddr1==TCURY)
                PROTOCOL_recvResponse(out_str,devaddr1,NO_ERROR,regaddr1,TOUCH.CURY);
            if (regaddr1==TCVER)
                PROTOCOL_recvResponse(out_str,devaddr1,NO_ERROR,regaddr1,TOUCH_VERSION);
            return NO_ERROR;
        }

        // BSL
        if ((devaddr1==BSL))
        {
            if (regaddr1==BSLVER)
                PROTOCOL_recvResponse(out_str,devaddr1,NO_ERROR,regaddr1,BSL_VERSION);
            return NO_ERROR;
        }

        // Main control version module
        if ((devaddr1==VERSIONCTRL))
        {
            if (regaddr1==MAIN_VER_REG_1)
                strcpy(out_str,MAIN_VERSION_TXT);
            if (regaddr1==MAIN_VER_REG_2)
                PROTOCOL_recvResponse(out_str,devaddr1,NO_ERROR,regaddr1,MAIN_VERSION);
            if (regaddr1==MOT_VER_REG)
                PROTOCOL_recvResponse(out_str,devaddr1,NO_ERROR,regaddr1,MOTOR_VERSION);
            if (regaddr1==SENS_VER_REG)
                PROTOCOL_recvResponse(out_str,devaddr1,NO_ERROR,regaddr1,SENSOR_VERSION);
            if (regaddr1==ENC_VER_REG)
                PROTOCOL_recvResponse(out_str,devaddr1,NO_ERROR,regaddr1,ENCODER_VERSION);
            if (regaddr1==PORT_VER_REG)
                PROTOCOL_recvResponse(out_str,devaddr1,NO_ERROR,regaddr1,PORT_VERSION);
            if (regaddr1==PWM_VER_REG)
                PROTOCOL_recvResponse(out_str,devaddr1,NO_ERROR,regaddr1,HPWM_VERSION);
            if (regaddr1==SPWM_VER_REG)
                PROTOCOL_recvResponse(out_str,devaddr1,NO_ERROR,regaddr1,SPWM_VERSION);
            if (regaddr1==ATMR_VER_REG)
                PROTOCOL_recvResponse(out_str,devaddr1,NO_ERROR,regaddr1,ATIMER_VERSION);
            if (regaddr1==TOUCH_VER_REG)
                PROTOCOL_recvResponse(out_str,devaddr1,NO_ERROR,regaddr1,TOUCH_VERSION);
            if (regaddr1==I2C_VER_REG)
                PROTOCOL_recvResponse(out_str,devaddr1,NO_ERROR,regaddr1,I2C_VERSION);
            if (regaddr1==USART_VER_REG)
                PROTOCOL_recvResponse(out_str,devaddr1,NO_ERROR,regaddr1,USART_VERSION);
            if (regaddr1==BSL_VER_REG)
                PROTOCOL_recvResponse(out_str,devaddr1,NO_ERROR,regaddr1,BSL_VERSION);
            return NO_ERROR;
        }

    }

    PROTOCOL_recvResponse(out_str,devaddr1,func1+0x80,regaddr1,LENGTH_ERROR);
    return LENGTH_ERROR;
}

